Revit 2026 API

# PrintParameters Class

---

An object that contains settings used for printing the document.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPrintParameters

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PrintParameters : APIObject
```
```vb
Public Class PrintParameters
	Inherits APIObject
```
```cpp
public ref class PrintParameters : public APIObject
```
```fsharp
type PrintParameters =
    class
        inherit APIObject
    end
```

The PrintParameters type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ColorDepth | The color depth type. |
|  | HiddenLineViews | The hidden line views type. |
|  | HideCropBoundaries | Indicates whether to hide crop boundaries when printing. |
|  | HideReforWorkPlanes | Indicates whether to hide reference/work planes when printing. |
|  | HideScopeBoxes | Indicates whether to hide scope boxes when printing. |
|  | HideUnreferencedViewTags | Indicates whether to hide unreferenced view tags when printing. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | MarginType | The print margin type. |
|  | MaskCoincidentLines | Indicates whether to mask coincident lines when printing. |
|  | OriginOffsetX | The User defined X value of offset from left bottom corner. Unit is feet. |
|  | OriginOffsetY | The User defined Y value of offset from left bottom corner. Unit is feet. |
|  | PageOrientation | The Page Orientation of the Print Setting. |
|  | PaperPlacement | The paper placement type. |
|  | PaperSize | The page size. |
|  | PaperSource | The page source. |
|  | RasterQuality | The raster quality type. |
|  | ReplaceHalftoneWithThinLines | Indicates whether to replace halftone with thin lines when printing. |
|  | UserDefinedMarginX | **Obsolete.** The User defined X value of offset from left bottom corner. Unit is inch. |
|  | UserDefinedMarginY | **Obsolete.** The User defined Y value of offset from left bottom corner. Unit is inch. |
|  | ViewLinksinBlue | Indicates whether to view links in blue when printing. |
|  | Zoom | The zoom value to a percentage of the original size. |
|  | ZoomType | The zoom type. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace